documents/UnitTestCase/API_Testing/SOAP_REQ_RES_XML/BookCPEResource/bookCPEResource_INVALID_STATUS_TRANSITON_NOTALLOWED_CENTRAL_REQUEST.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.bl.cpe.elitecore.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:bookCPEResource>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <isResourceRecoverable/>
            <operationType>1</operationType>
            <!--Optional:-->
            <orderLineItemID>TEST12</orderLineItemID>
            <!--Zero or more repetitions:-->
            <reserveAllocateRequestVO>
               <!--Optional:-->
               <inventoryNo>sjh000000007</inventoryNo>
               <!--Optional:-->
               <serialNumber/>
            </reserveAllocateRequestVO>
            <reserveAllocateRequestVO>
               <!--Optional:-->
               <inventoryNo>D00000000002</inventoryNo>
               <!--Optional:-->
               <serialNumber/>
            </reserveAllocateRequestVO>
         </arg0>
      </ws:bookCPEResource>
   </soapenv:Body>
</soapenv:Envelope>